## Final Project Submission

Please fill out:
* Student name: Theodore Brnadon
* Student pace: full time
* Scheduled project review date/time: 9/17/2021, ~8:30am
* Instructor name: Angelica Spratley
* Blog post URL:  https://medium.com/@tedbrandon/newly-budding-data-scientist-looking-for-correlation-in-all-the-right-places-efd34770c10d

In [1]:
# Your code here - remember to use markdown cells for comments as well!

In [2]:
import json
import csv
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from seaborn import lmplot
#import sqlite3 
#conn = sqlite3.connect('data.sqlite') ## 'data' should be whatever file I'm using

In [3]:
gross = pd.read_csv('bom.movie_gross.csv')

In [4]:
gross.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [5]:
gross

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [6]:
NA_drops = gross.copy()
#print(gross)
NA_drops.dropna(inplace = True)
print(gross.info())
print(NA_drops.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB
None
<class 'pandas.core.frame.DataFrame'>
Int64Index: 2007 entries, 0 to 3353
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2007 non-null   object
 1   studio          2007 non-null   object
 2   domestic_gross  2007 non-null   float64
 3   foreign_gross   2007 non-null   object
 4   year            2007 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 94.1+ KB
None

In [7]:
NA_drops = NA_drops.sort_values('domestic_gross', ascending = False)

In [8]:
NA_drops.head()

                             title studio  domestic_gross foreign_gross  year
1872  Star Wars: The Force Awakens     BV     936700000.0       1,131.6  2015
3080                 Black Panther     BV     700100000.0     646900000  2018
3079        Avengers: Infinity War     BV     678800000.0       1,369.5  2018
1873                Jurassic World   Uni.     652300000.0       1,019.4  2015
727          Marvel's The Avengers     BV     623400000.0     895500000  2012

When I trim off all of the missing foreign gross data, and sort, descending by dom_gross, I notice a few things - The highest grossing movie in the US corresponds to an abysmally low foreign gross.  It looks like the foreign gross is actually listed as 10^6.  Figuring in the appropriate adjustment, the numbers make way more sense.  A plot of these columns against each other aught to show some pretty big outliers.

In [17]:
New = gross.copy()
New.dropna(inplace = True)#.sort_values('domestic_gross',asending = False, ignore_index=True)
#print(gross.info())
print(New.info())
New = New.sort_values('domestic_gross', ascending = False, ignore_index=True)
New.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2007 entries, 0 to 3353
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2007 non-null   object
 1   studio          2007 non-null   object
 2   domestic_gross  2007 non-null   float64
 3   foreign_gross   2007 non-null   object
 4   year            2007 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 94.1+ KB
None

                          title studio  domestic_gross foreign_gross  year
0  Star Wars: The Force Awakens     BV     936700000.0       1,131.6  2015
1                 Black Panther     BV     700100000.0     646900000  2018
2        Avengers: Infinity War     BV     678800000.0       1,369.5  2018
3                Jurassic World   Uni.     652300000.0       1,019.4  2015
4         Marvel's The Avengers     BV     623400000.0     895500000  2012

In [27]:
x = New['domestic_gross'].values_counts()
y = New['foreign_gross'].values()
sns.relplot(data = New(x,y))

AttributeError: 'Series' object has no attribute 'values_counts'

In [ ]:
dom_for = (NA_drops['domestic_gross'], NA_drops['foreign_gross'])

print(NA_drops['domestic_gross'].head())

sns.relplot(data = dom_for)
;

In [ ]:
studios = (NA_drops['studio'].unique())
studios = sorted(studios)

print(studios)
print(len(studios))
type(studios[0])

In [ ]:
sns.barplot(data = NA_drops)
;

In [ ]:
sns.implot(NA_drops)